siddharthcmdz/firmware/sketches/ESP32/ESP32-MPU6050-detection/src/main.cpp
#include <Arduino.h>
#include <Wire.h>
#include <Adafruit_MPU6050.h>
#include <Adafruit_Sensor.h>

const int SDA_PIN = 21; // your Elegoo ESP32's I²C pins
const int SCL_PIN = 22;
const int LED_PIN = 2; // onboard LED pin (optional, for status indication)
const int BUZZER_PIN = 13;
const int SOS_FREQ = 2700; // ~peak loudness for typical Elegoo piezo

Adafruit_MPU6050 mpu;

const float FREEFALL_THRESHOLD_G = 0.4f; // Threshold in m/s^2 to detect free fall
const int FREEFALL_MIN_SAMPLES = 10;     // Minimum number of consecutive samples below threshold to confirm free fall
const float IMPACT_THRESHOLD_G = 2.0f;   // Threshold in m/s^2 to detect impact
const int IMPACT_WINDOW_SAMPLES = 50;    // Number of samples to check for impact after free fall
const int POST_FALL_HOLD_SAMPLES = 200;  // Number of samples to hold after detecting free fall

enum FallState
{
  IDLE,
  IN_FREEFALL,
  AWAITING_FOR_IMPACT,
  FALL_DETECTED
};

FallState state = IDLE;
int freefall_run = 0;
int impact_window_remaining = 0;
int post_fall_remaining = 0;

bool identifyMPU6050()
{
  Wire.beginTransmission(0x68); // MPU6050 I2C address
  Wire.write(0x75);             // WHO_AM_I register
  Wire.endTransmission(false);

  Wire.requestFrom(0x68, 1); // Request 1 byte from the MPU6050
  if (Wire.available())
  {
    uint8_t whoAmI = Wire.read();
    return whoAmI == 0x68; // Check if the response matches the expected value
  }

  return false; // If no response, return false
}

void playTone(int pin, int freq, int duration_ms)
{
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
  // v3.x API — pin-addressed
  ledcAttach(pin, freq, 8);
  ledcWrite(pin, 128); // 50% duty cycle (max volume for a piezo)
  delay(duration_ms);
  ledcWrite(pin, 0);
  ledcDetach(pin);
#else
  // v2.x API — channel-addressed
  const int channel = 0;       // ESP32 has 16 LEDC channels (0–15)
  ledcSetup(channel, freq, 8); // configure channel: frequency Hz, 8-bit resolution
  ledcAttachPin(pin, channel); // route channel output to the pin
  ledcWrite(channel, 128);     // 50% duty cycle
  delay(duration_ms);
  ledcWrite(channel, 0);
  ledcDetachPin(pin);
#endif
}

void play_sos_pattern()
{
  // 3 short beeps (200 ms each, 200 ms gap)
  for (int i = 0; i < 3; i++)
  {
    playTone(BUZZER_PIN, SOS_FREQ, 200);
    delay(400); // 200 ms tone + 200 ms silence
  }
  delay(200);

  // 3 long beeps (600 ms each, 200 ms gap) — Morse "O"
  for (int i = 0; i < 3; i++)
  {
    playTone(BUZZER_PIN, SOS_FREQ, 600);
    delay(800);
  }
  delay(200);

  // 3 short beeps again
  for (int i = 0; i < 3; i++)
  {
    playTone(BUZZER_PIN, SOS_FREQ, 200);
    delay(400);
  }
}

void play_cancellation_chirp()
{
  // Two quick high-frequency chirps; suggest urgency without being alarm-fatigue-y
  tone(BUZZER_PIN, 3000, 100);
  delay(150);
  tone(BUZZER_PIN, 3000, 100);
  delay(900); // most of the second is silence, so it's not annoying
}

void find_resonance()
{
  Serial.println("Listening for the loudest pitch...");
  for (int f = 1500; f <= 4500; f += 100)
  {
    Serial.printf("  %d Hz\n", f);
    playTone(BUZZER_PIN, f, 400);
    delay(200);
  }
  Serial.println("Done — pick the loudest one.");
}

void setup()
{
  // put your setup code here, to run once:
  Serial.begin(460800);
  pinMode(LED_PIN, OUTPUT);
  delay(500); // Wait for Serial to initialize
  Wire.begin(SDA_PIN, SCL_PIN);
  Wire.setClock(400000);

  bool mpu6050Detected = identifyMPU6050();
  if (mpu6050Detected)
  {
    Serial.println("# MPU6050 detected!");
  }
  else
  {
    Serial.println("# MPU6050 not detected.");
    while (1)
      delay(1000); // Stop execution if MPU6050 is not detected
  }

  if (!mpu.begin())
  {
    Serial.println("# Failed to find MPU6050 chip");
    while (1)
      delay(1000); // Stop execution if MPU6050 initialization fails
  }

  mpu.setAccelerometerRange(MPU6050_RANGE_8_G);
  mpu.setGyroRange(MPU6050_RANGE_500_DEG);
  mpu.setFilterBandwidth(MPU6050_BAND_44_HZ);

  // Header row — your Python script will look for this
  Serial.println("# RakshaBand IMU Logger v1");
  Serial.println("# sensor=ICM-42670-P accel_range=8g gyro_range=500dps rate=100Hz");
  Serial.println("t_ms,ax_g,ay_g,az_g,gx_dps,gy_dps,gz_dps");

  // Now identify the passive buzzer
  pinMode(BUZZER_PIN, OUTPUT);
  Serial.println("Beep at 2000 Hz...");
  playTone(BUZZER_PIN, 2000, 500);
  delay(700);

  // Serial.println("Sweep 500-3000 Hz...");
  for (int f = 500; f <= 3000; f += 30)
  {
    playTone(BUZZER_PIN, f, 20);
    delay(20);
  }

  // find_resonance();

  Serial.println("Buzzer Done");
}

const float G_TO_MS2 = 9.80665f; // Conversion factor from g to m/s^2

void loop()
{
  // put your main code here, to run repeatedly:
  static unsigned long next_sample_ms = 0;
  const unsigned long sample_interval_ms = 10; // Sample every 100 ms

  unsigned long now = millis();
  if ((long)(now - next_sample_ms) < 0)
  {
    return; // Not time for the next sample yet
  }
  next_sample_ms += sample_interval_ms;

  sensors_event_t a, g, temp;
  mpu.getEvent(&a, &g, &temp);

  float accelX = a.acceleration.x / G_TO_MS2; // Convert to g for easier threshold comparison
  float accelY = a.acceleration.y / G_TO_MS2;
  float accelZ = a.acceleration.z / G_TO_MS2;

  float accelMagnitude = sqrt(accelX * accelX + accelY * accelY + accelZ * accelZ);

  switch (state)
  {
  case IDLE:
  {
    if (accelMagnitude < FREEFALL_THRESHOLD_G)
    {
      freefall_run = 1;
      state = IN_FREEFALL;
    }
  }
  break;

  case IN_FREEFALL:
  {
    if (accelMagnitude < FREEFALL_THRESHOLD_G)
    {
      freefall_run++;
      if (freefall_run >= FREEFALL_MIN_SAMPLES)
      {
        state = AWAITING_FOR_IMPACT;
        impact_window_remaining = IMPACT_WINDOW_SAMPLES;
        // Serial.println("# Free fall detected, awaiting impact...");
      }
    }
    else
    {
      freefall_run = 0; // Reset if we go back above threshold
      state = IDLE;
    }
  }
  break;

  case AWAITING_FOR_IMPACT:
  {
    if (accelMagnitude > IMPACT_THRESHOLD_G)
    {
      state = FALL_DETECTED;
      post_fall_remaining = POST_FALL_HOLD_SAMPLES;
      digitalWrite(LED_PIN, HIGH); // Turn on LED to indicate fall detected
      // Serial.printf("# Fall candidate detected, peak ~%0.2fg\n", accelMagnitude);
      play_sos_pattern();
    }
    else
    {
      impact_window_remaining--;
      if (impact_window_remaining <= 0)
      {
        state = IDLE; // No impact detected within window, reset
        freefall_run = 0;
        // Serial.println("# No impact detected, resetting...");
      }
    }
  }
  break;

  case FALL_DETECTED:
  {
    post_fall_remaining--;
    if (post_fall_remaining <= 0)
    {
      state = IDLE; // Reset after hold period
      freefall_run = 0;
      digitalWrite(LED_PIN, LOW); // Turn off LED
      // Serial.println("# Resetting after fall detection...");
    }
  }
  break;
  default:
    break;
  }

  // Serial.printf("# %.3f,%.3f,%.3f\n", accelX, accelY, accelZ);

  float gyroX = g.gyro.x * 57.29578f;
  float gyroY = g.gyro.y * 57.29578f;
  float gyroZ = g.gyro.z * 57.29578f;

  Serial.printf("%lu, %.4f,%.4f,%.4f,%.3f,%.3f,%.3f\n",
                now,
                accelX, accelY, accelZ,
                gyroX, gyroY, gyroZ);
}
